[
	{
		"title": "Penn OS",
		"desc": "A single-threaded OS abstraction with kernel, priority scheduler, FAT-like filesystem, and process control blocks. Maintain kernel-user separation through system call interfaces for file I/O, permissions, and process management. Simulates context-switching and pre-emptive multitasking through thread suspension."
	},
	{
		"title": "Opportunistic Parallelism in PL",
		"desc": "Compiler from a subset of Python to a low-level lambda calculus based functional IR, with the ability to evaluate in parallel while conserving programmer intent. IR features include static single assignment and church encoded conditionals, control flow, and booleans. Achieved significant performance gains on real-world scripts, reducing latency by 12.7x and running time by 6.2x. Related publication below:",
		"site_url": "https://arxiv.org/abs/2405.11361"
	},
	{
		"title": "Oat Compiler",
		"img": "ocaml.png",
		"desc": "Fully functional compiler to x86 assembly from Oat, a simply typed language featuring functions/lambdas, structs, arrays, and strings. Features a type checker, parser, and custom codegeneration to/from LLVM IR. Used basic dataflow analyses to implement optimizations like dead code elimination, constant propogation, register allocation, and more."
	},
	{
		"title": "Penn Course Review",
		"img": "pcr.png",
		"desc": "Maintaining and adding features (Comments, static rendering) to the official course review platform for the University of Pennsylvania. ",
		"site_url": "https://penncoursereview.com/",
		"src_url": "https://github.com/pennlabs/penn-courses"
	},
	{
		"title": "Netsagram",
		"img": "netstagram.png",
		"desc": "A scalable instagram clone, including authentication, post rank, RAG facematch, and friend recommendation microservices. Leveraging Apache Kafka, Apache Spark, ChromaDB, and various AWS services deployed through Terraform.",
		"src_url": "https://github.com/"
	},
	{
		"title": "Sparkify (Penn Spark Fall 2023)",
		"img": "sparkify.png",
		"desc": "A web app that uses AI to generate a user's collage of their top music taste on Spotify. Built with Python, Svelte, and AWS Lambda",
		"src_url": "https://github.com/PennSpark/fa23-sparkify"
	},
	{
		"title": "The Daily Pennsylvanian Platform API",
		"img": "thedp.png",
		"desc": "A unified API for The Daily Pennsylvanian, Under the Button, and 34th Street websites, as well as the DP+ mobile app. Built with Express, MongoDB, and TypeScript",
		"src_url": "https://github.com/dailypenn/api.thedp.com"
	},
	{
		"title": "The Tower PHS",
		"img": "thetowerphs.png",
		"desc": "The website for Princeton High School's newspaper club, The Tower. Written with Next.js, Prisma, and TypeScript and uses postgreSQL as a database",
		"site_url": "https://www.towerphs.com/home",
		"src_url": "https://github.com/luke-rt/thetowerphs.com"
	},
	{
		"title": "Asciiframe",
		"img": "asciiframe.png",
		"desc": "A command-line tool that can convert any video (or image) into a stream of ascii characters that can be played in the terminal. Written with Rust and Open Computer Vision.",
		"src_url": "https://github.com/luke-rt/asciiframe"
	},
	{
		"title": "Guess the Number OS (Kernel)",
		"img": "guess-the-number.png",
		"desc": "A bare metal, 32-bit kernel + custom bootloader written in C and Intel x86. All it does is play guess the number.",
		"src_url": "https://github.com/luke-rt/guess-the-number"
	}
]
